               To Reproduce issue: Change configuration in startup-script and run the plan again and then apply and apply 
   
               Plan with Debug Mode


2020-09-29T06:57:06.318Z [DEBUG] plugin.terraform-provider-google_v3.40.0_x5: 2020/09/29 06:57:06 [INFO] Instantiating Google Cloud Healthcare client for path https://healthcare.googleapis.com/
2020/09/29 06:57:06 [DEBUG] ReferenceTransformer: "google_compute_address.static" references: []
2020/09/29 06:57:06 [DEBUG] ReferenceTransformer: "google_compute_instance.web_private_1" references: []
2020/09/29 06:57:06 [DEBUG] ReferenceTransformer: "google_compute_health_check.healthcheck" references: []
2020/09/29 06:57:06 [WARN] Provider "registry.terraform.io/-/google" produced an invalid plan for google_compute_instance.web_private_1, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .scheduling: block count in plan (1) disagrees with count in config (0)
2020/09/29 06:57:06 [DEBUG] ReferenceTransformer: "google_compute_instance_group.web_private_group" references: []
2020/09/29 06:57:06 [WARN] Provider "registry.terraform.io/-/google" produced an invalid plan for google_compute_instance_group.web_private_group, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .instances: planned value cty.UnknownVal(cty.Set(cty.String)) does not match config value cty.SetVal([]cty.Value{cty.UnknownVal(cty.String)}) nor prior value cty.SetVal([]cty.Value{cty.StringVal("https://www.googleapis.com/compute/v1/projects/xxxxxx/zones/europe-west4-a/instances/front-end-vm1")})
2020/09/29 06:57:06 [DEBUG] ReferenceTransformer: "google_compute_backend_service.backend_service" references: []
2020-09-29T06:57:06.387Z [DEBUG] plugin.terraform-provider-google_v3.40.0_x5: 2020/09/29 06:57:06 [DEBUG] hashing map[balancing_mode:RATE capacity_scaler:1 description: group:https://www.googleapis.com/compute/v1/projects/xxxxxx/zones/europe-west4-a/instanceGroups/front-end-vm-group max_connections:0 max_connections_per_endpoint:0 max_connections_per_instance:0 max_rate:0 max_rate_per_endpoint:0 max_rate_per_instance:100 max_utilization:0.8]
2020-09-29T06:57:06.388Z [DEBUG] plugin.terraform-provider-google_v3.40.0_x5: 2020/09/29 06:57:06 [DEBUG] writing description 
2020-09-29T06:57:06.388Z [DEBUG] plugin.terraform-provider-google_v3.40.0_x5: 2020/09/29 06:57:06 [DEBUG] computed hash value of 3514313238 from projects/xxxxxx/zones/europe-west4-a/instanceGroups/front-end-vm-group-RATE-1.000000--0-100.000000-0-0-100.000000-0-0.000000-
2020-09-29T06:57:06.388Z [DEBUG] plugin.terraform-provider-google_v3.40.0_x5: 2020/09/29 06:57:06 [DEBUG] hashing map[balancing_mode:RATE capacity_scaler:1 description: group:https://www.googleapis.com/compute/v1/projects/xxxxxx/zones/europe-west4-a/instanceGroups/front-end-vm-group max_connections:0 max_connections_per_endpoint:0 max_connections_per_instance:0 max_rate:0 max_rate_per_endpoint:0 max_rate_per_instance:100 max_utilization:0.8]
2020-09-29T06:57:06.388Z [DEBUG] plugin.terraform-provider-google_v3.40.0_x5: 2020/09/29 06:57:06 [DEBUG] writing description 
2020-09-29T06:57:06.388Z [DEBUG] plugin.terraform-provider-google_v3.40.0_x5: 2020/09/29 06:57:06 [DEBUG] computed hash value of 3514313238 from projects/xxxxxx/zones/europe-west4-a/instanceGroups/front-end-vm-group-RATE-1.000000--0-100.000000-0-0-100.000000-0-0.000000-
2020-09-29T06:57:06.389Z [DEBUG] plugin.terraform-provider-google_v3.40.0_x5: 2020/09/29 06:57:06 [DEBUG] hashing map[balancing_mode:RATE capacity_scaler:1 description: group:https://www.googleapis.com/compute/v1/projects/xxxxxx/zones/europe-west4-a/instanceGroups/front-end-vm-group max_connections:0 max_connections_per_endpoint:0 max_connections_per_instance:0 max_rate:0 max_rate_per_endpoint:0 max_rate_per_instance:100 max_utilization:0.8]
2020-09-29T06:57:06.389Z [DEBUG] plugin.terraform-provider-google_v3.40.0_x5: 2020/09/29 06:57:06 [DEBUG] writing description 
2020-09-29T06:57:06.389Z [DEBUG] plugin.terraform-provider-google_v3.40.0_x5: 2020/09/29 06:57:06 [DEBUG] computed hash value of 3514313238 from projects/xxxxxx/zones/europe-west4-a/instanceGroups/front-end-vm-group-RATE-1.000000--0-100.000000-0-0-100.000000-0-0.000000-
2020/09/29 06:57:06 [DEBUG] ReferenceTransformer: "google_compute_url_map.url_map" references: []
2020/09/29 06:57:06 [DEBUG] ReferenceTransformer: "google_compute_target_http_proxy.target_http_proxy" references: []
2020/09/29 06:57:06 [DEBUG] ReferenceTransformer: "google_compute_global_forwarding_rule.global_forwarding_rule" references: []
2020-09-29T06:57:06.558Z [DEBUG] plugin: plugin process exited: path=/home/xxxxxx/test-code/new-code/.terraform/plugins/linux_amd64/terraform-provider-google_v3.40.0_x5 pid=30185
2020-09-29T06:57:06.559Z [DEBUG] plugin: plugin exited
2020/09/29 06:57:06 [INFO] backend/local: plan operation completed

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_instance.web_private_1 must be replaced
-/+ resource "google_compute_instance" "web_private_1" {
        allow_stopping_for_update = true
        can_ip_forward            = false
      ~ cpu_platform              = "Intel Skylake" -> (known after apply)
      ~ current_status            = "RUNNING" -> (known after apply)
        deletion_protection       = false
      - enable_display            = false -> null
      ~ guest_accelerator         = [] -> (known after apply)
        hostname                  = "front-end-vm1.web-server"
      ~ id                        = "projects/xxxxxx/zones/europe-west4-a/instances/front-end-vm1" -> (known after apply)
      ~ instance_id               = "xxxxxxx1515541722" -> (known after apply)
      ~ label_fingerprint         = "42WmSpBxxxx=" -> (known after apply)
      - labels                    = {} -> null
        machine_type              = "n1-standard-1"
      - metadata                  = {} -> null
      ~ metadata_fingerprint      = "ZAWqq7xxxx=" -> (known after apply)
      ~ metadata_startup_script   = <<~EOT # forces replacement
            #!/bin/bash
            set -e
            echo "*****    Installing Nginx    *****"
            apt update
            apt install -y nginx
            systemctl enable nginx
            systemctl restart nginx
            
            echo "*****   Installation Complteted!!   *****"
          - echo "welcome 2nd change" > /tmp/test
          + echo "welcome 3rd change" > /tmp/test
            echo "Welcome to Google Compute VM Instance deployed using Terraform!!!" > /var/www/html
            
            echo "*****   Startup script completes!!    *****"
        EOT
      + min_cpu_platform          = (known after apply)
	          name                      = "front-end-vm1"
      ~ project                   = "xxxxxx" -> (known after apply)
      - resource_policies         = [] -> null
      ~ self_link                 = "https://www.googleapis.com/compute/v1/projects/xxxxxx/zones/europe-west4-a/instances/front-end-vm1" -> (known after apply)
        tags                      = [
            "http-server",
            "https-server",
            "sh-kong-2-1",
        ]
      ~ tags_fingerprint          = "X6uOeXpCJq0=" -> (known after apply)
        zone                      = "europe-west4-a"

      ~ boot_disk {
            auto_delete                = true
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
            mode                       = "READ_WRITE"
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/xxxxxx/zones/europe-west4-a/disks/front-end-vm1" -> (known after apply)

          ~ initialize_params {
              ~ image  = "https://www.googleapis.com/compute/v1/projects/debian-cloud/global/images/debian-9-stretch-v20200910" -> "debian-cloud/debian-9"
              ~ labels = {} -> (known after apply)
              ~ size   = 10 -> (known after apply)
              ~ type   = "pd-standard" -> (known after apply)
            }
        }

      ~ network_interface {
          ~ name               = "nic0" -> (known after apply)
          ~ network            = "https://www.googleapis.com/compute/v1/projects/xxxxxx/global/networks/xxxxxx-euw4-ctf-vpc" -> "projects/xxxxxx/global/networks/xxxxxx-euw4-ctf-vpc"
            network_ip         = "1xx.xx.xx.x"
          ~ subnetwork         = "https://www.googleapis.com/compute/v1/projects/xxxxxx/regions/europe-west4/subnetworks/xxxxxx-euwest-xxxxxx-control-sub-prim" -> "projects/xxxxxx/regions/europe-west4/subnetworks/xxxxxx-euwest-xxx-control-sub-prim"
          ~ subnetwork_project = "xxxxxx" -> (known after apply)

          ~ access_config {
              ~ nat_ip       = "xx.xx.xx.xxx" -> (known after apply)
			  }
			}
			
			      ~ scheduling {
          ~ automatic_restart   = true -> (known after apply)
          ~ on_host_maintenance = "MIGRATE" -> (known after apply)
          ~ preemptible         = false -> (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }

      ~ service_account {
          ~ email  = "xxxxxxxx-compute@developer.gserviceaccount.com" -> (known after apply)
            scopes = [
                "https://www.googleapis.com/auth/compute.readonly",
                "https://www.googleapis.com/auth/devstorage.read_only",
                "https://www.googleapis.com/auth/userinfo.email",
            ]
        }
    }
  # google_compute_instance_group.web_private_group will be updated in-place
  ~ resource "google_compute_instance_group" "web_private_group" {
        description = "Web servers instance group"
        id          = "projects/xxxxxx/zones/europe-west4-a/instanceGroups/front-end-vm-group"
      ~ instances   = [
2020/09/29 06:58:57 [DEBUG] command: asking for input: "Do you want to perform these actions?"
          - "https://www.googleapis.com/compute/v1/projects/xxxxxx/zones/europe-west4-a/instances/front-end-vm1",
        ] -> (known after apply)
        name        = "front-end-vm-group"
        network     = "https://www.googleapis.com/compute/v1/projects/xxxxxx/global/networks/xxxxxx-euw4-ctf-vpc"
        project     = "xxxxxx"
        self_link   = "https://www.googleapis.com/compute/v1/projects/xxxxxx/zones/europe-west4-a/instanceGroups/front-end-vm-group"
        size        = 1
        zone        = "europe-west4-a"

        named_port {
            name = "http"
            port = 80
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.

 
               Apply with debug mode

2020-09-29T06:59:33.348Z [DEBUG] plugin.terraform-provider-google_v3.40.0_x5: 2020/09/29 06:59:33 [DEBUG] Retry Transport: Returning after 1 attempts
google_compute_instance.web_private_1: Creation complete after 12s [id=projects/xxxxxx/zones/europe-west4-a/instances/front-end-vm1]
2020/09/29 06:59:33 [WARN] Provider "registry.terraform.io/-/google" produced an unexpected new value for google_compute_instance.web_private_1, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .description: was null, but now cty.StringVal("")
      - .enable_display: was null, but now cty.False
      - .boot_disk[0].disk_encryption_key_raw: inconsistent values for sensitive attribute
      - .boot_disk[0].initialize_params[0].image: was cty.StringVal("debian-cloud/debian-9"), but now cty.StringVal("https://www.googleapis.com/compute/v1/projects/debian-cloud/global/images/debian-9-stretch-v20200910")
      - .network_interface[0].network: was cty.StringVal("projects/xxxxxx/global/networks/xxxxxx-euw4-ctf-vpc"), but now cty.StringVal("https://www.googleapis.com/compute/v1/projects/xxxxxx/global/networks/xxxxxx-euw4-ctf-vpc")
      - .network_interface[0].subnetwork: was cty.StringVal("projects/xxxxxx/regions/europe-west4/subnetworks/xxxxxx-euwest-ctef-control-sub-prim"), but now cty.StringVal("https://www.googleapis.com/compute/v1/projects/xxxxxx/regions/europe-west4/subnetworks/xxxxxx-euwest-ctef-control-sub-prim")
2020/09/29 06:59:33 [DEBUG] After incorporating new values learned so far during apply, google_compute_instance_group.web_private_group change has become NoOp
2020-09-29T06:59:33.365Z [DEBUG] plugin: plugin process exited: path=/home/xxxxxx/test-code/new-code/.terraform/plugins/linux_amd64/terraform-provider-google_v3.40.0_x5 pid=30293
2020-09-29T06:59:33.366Z [DEBUG] plugin: plugin exited

Apply complete! Resources: 1 added, 0 changed, 1 destroyed.


                 2nd apply with debug mode

Terraform will perform the following actions:

  # google_compute_instance_group.web_private_group will be updated in-place
  ~ resource "google_compute_instance_group" "web_private_group" {
        description = "Web servers instance group"
        id          = "projects/xxxxxx/zones/europe-west4-a/instanceGroups/front-end-vm-group"
      ~ instances   = [
          + "https://www.googleapis.com/compute/v1/projects/xxxxxx/zones/europe-west4-a/instances/front-end-vm1",
        ]
        name        = "front-end-vm-group"
        network     = "https://www.googleapis.com/compute/v1/projects/xxxxxx/global/networks/xxxxxx-euw4-ctf-vpc"
        project     = "xxxxxx"
        self_link   = "https://www.googleapis.com/compute/v1/projects/xxxxxx/zones/europe-west4-a/instanceGroups/front-end-vm-group"
        size        = 0
        zone        = "europe-west4-a"

        named_port {
            name = "http"
            port = 80
        }
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

2020-09-29T07:00:54.549Z [DEBUG] plugin: plugin process exited: path=/home/shubham/test-code/new-code/.terraform/plugins/linux_amd64/terraform-provider-google_v3.40.0_x5 pid=30366
2020-09-29T07:00:54.549Z [DEBUG] plugin: plugin exited
2020/09/29 07:00:54 [DEBUG] command: asking for input: "Do you want to perform these actions?"
  Enter a value: yes
2020/09/29 07:02:46 [INFO] backend/local: apply calling Apply

google_compute_instance_group.web_private_group: Modifications complete after 1s [id=projects/xxxxxx/zones/europe-west4-a/instanceGroups/front-end-vm-group]
2020/09/29 07:02:48 [WARN] Provider "registry.terraform.io/-/google" produced an unexpected new value for google_compute_instance_group.web_private_group, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .size: was cty.NumberIntVal(0), but now cty.NumberIntVal(1)
2020-09-29T07:02:48.568Z [DEBUG] plugin: plugin process exited: path=/home/shubham/test-code/new-code/.terraform/plugins/linux_amd64/terraform-provider-google_v3.40.0_x5 pid=30389
2020-09-29T07:02:48.569Z [DEBUG] plugin: plugin exited
           